{
  "backend/main.mo": "Main canister logic defining user profiles, sessions, calls, scheduled sessions, and authorization-protected operations with timers and state maps.",
  "backend/migration.mo": "Migration module converting old actor state to the new structure by initializing scheduled sessions and new session ID counter.",
  "feature_evidence.json": "JSON report listing feature implementations, associated files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, UI, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, color variables, light/dark themes, and global utility layers.",
  "frontend/index.html": "Basic HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Configures routes with TanStack Router, wraps app with theme provider, and integrates auth-protected pages.",
  "frontend/src/components/auth/AuthButtons.tsx": "Renders login/logout UI using Internet Identity and user profile data with dropdown actions.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard that redirects unauthenticated users to login and shows a loading screen during identity initialization.",
  "frontend/src/components/auth/RequireProfile.tsx": "Ensures the user has a profile, redirecting to signup if missing and showing a loading state during fetch.",
  "frontend/src/components/feedback/StarRating.tsx": "Interactive star rating component with hover and click support, allowing optional read-only mode and size variants.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper providing background styling, navbar, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying brand info, contact link, social icons, and a dynamic copyright.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navigation bar with links, theme toggle, auth buttons, and mobile sheet menu.",
  "frontend/src/components/liveclass/JoinLinkBox.tsx": "Generates and displays a sharable join link with copy-to-clipboard support for calls or sessions.",
  "frontend/src/components/liveclass/VideoCallPanel.tsx": "Manages WebRTC video call UI and lifecycle, handling offers, answers, ICE candidates, and stream setup.",
  "frontend/src/components/marketing/FeaturesSection.tsx": "Displays a grid of marketing feature cards with icons and descriptions.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Shows a three-step explanation of how the platform works using icon cards.",
  "frontend/src/components/match/MatchCard.tsx": "Card showing a match's skills, rating, credit cost, and a button to book a session.",
  "frontend/src/components/sessions/BookSessionDialog.tsx": "Provides a dialog for booking a scheduled session, validating date/time, and submitting a create-session mutation.",
  "frontend/src/components/sessions/CreateSessionDialog.tsx": "Dialog to create a new scheduled session with optional title, skill selection, and time inputs, then submit via mutation.",
  "frontend/src/components/sessions/SessionJoinLinkDialog.tsx": "Shows a generated session join link with copy-to-clipboard support after session creation.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Light/dark theme toggle button using next-themes.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, auto-refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useCallSignaling.ts": "Hooks for initiating, answering, and managing WebRTC signaling calls via backend actor methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, and logout via AuthClient with context-based access.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, scheduled sessions, feedback, and session creation/joining via the backend actor.",
  "frontend/src/hooks/useSessionsLocal.ts": "Manages user-specific localStorage sessions, allowing loading, adding, and removing session entries keyed by principal.",
  "frontend/src/hooks/useSessionTimer.ts": "Simple timer hook tracking elapsed seconds with start, stop, and reset controls.",
  "frontend/src/hooks/useWebRTCPeer.ts": "Implements a WebRTC peer connection hook handling media initialization, offer/answer creation, ICE candidates, stream updates, and connection state tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes, plus utility classes for gradients, cards, and transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user profile, credits, upcoming sessions, and allows creating or joining scheduled sessions with validation and navigation handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero content, features, testimonials, and navigation actions for learning or teaching.",
  "frontend/src/pages/LiveClassPage.tsx": "Handles the live class experience including call initiation, signaling, timers, scheduled session logic, and post-session feedback.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login UI and redirects authenticated users to a target page or the dashboard.",
  "frontend/src/pages/SignupProfilePage.tsx": "React page for collecting user name and skills, handling skill add/remove, and submitting profile creation before navigating to the dashboard.",
  "frontend/src/pages/SkillMatchPage.tsx": "Skill matching page with search, category filters, mock match data, and session booking flow requiring login.",
  "frontend/src/utils/creditCalculation.ts": "Provides a simple deterministic credit calculation based on session duration and rating.",
  "frontend/src/utils/scheduledSessionTime.ts": "Utility functions for converting nanosecond timestamps, formatting session times, validating join windows, and checking future dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Metadata describing project version, scope, requirements, existing features, and architectural notes for the Skill Sync platform."
}