{
  "backend/main.mo": "Defines user profiles, sessions, calls, and access-controlled methods for managing profiles and timed learning sessions using timers and authorization mixins.",
  "backend/migration.mo": "Placeholder migration module exposing a no-op run function.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of major frontend files including components, pages, hooks, and utilities.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes along with global styling.",
  "frontend/index.html": "Basic HTML entrypoint loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication guards, theme provider, and the global app shell.",
  "frontend/src/components/auth/AuthButtons.tsx": "Authentication UI showing login or a user dropdown with logout using Internet Identity and React Query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that redirects unauthenticated users to login and shows a loading spinner during identity initialization.",
  "frontend/src/components/auth/RequireProfile.tsx": "Ensures the authenticated user has a profile, redirecting to signup if missing and displaying a loading state while fetching.",
  "frontend/src/components/feedback/StarRating.tsx": "Interactive or readonly five-star rating component with hover effects and configurable size.",
  "frontend/src/components/layout/AppShell.tsx": "Layout container providing the global background gradient, navbar, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, contact email, social links, and a dynamic year plus referral link.",
  "frontend/src/components/layout/Navbar.tsx": "Provides a responsive navigation bar with logo, links, theme toggle, auth buttons, and a mobile sheet menu.",
  "frontend/src/components/liveclass/JoinLinkBox.tsx": "Displays a shareable join link for a live class with copy-to-clipboard functionality.",
  "frontend/src/components/liveclass/VideoCallPanel.tsx": "Manages WebRTC video call UI and signaling flow, initializing streams, handling offers/answers, ICE candidates, and call lifecycle.",
  "frontend/src/components/marketing/FeaturesSection.tsx": "Shows a grid of marketing feature cards highlighting key platform capabilities.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Explains the platform workflow in three steps using icon-based cards.",
  "frontend/src/components/match/MatchCard.tsx": "Displays a match profile card with skills, rating, credit cost, and a button to book a session.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Toggles light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCallSignaling.ts": "Provides React Query hooks for initiating, answering, updating, and ending WebRTC call signaling via the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for handling Internet Identity authentication, including loading, login, logout, and tracking login state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profile data, sessions, and feedback via the backend actor.",
  "frontend/src/hooks/useSessionsLocal.ts": "Manages user-specific localStorage session data keyed by identity, with add and remove helpers.",
  "frontend/src/hooks/useSessionTimer.ts": "A simple timer hook that tracks elapsed seconds and provides start, stop, and reset controls.",
  "frontend/src/hooks/useWebRTCPeer.ts": "Wraps WebRTC peer connection setup and media handling, exposing offer/answer creation, ICE management, and local/remote stream state.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styles, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing user profile details, ratings, credits, skills, and upcoming local sessions with navigation actions.",
  "frontend/src/pages/HomePage.tsx": "Marketing-style landing page with hero section, features, testimonials, and navigation actions based on identity state.",
  "frontend/src/pages/LiveClassPage.tsx": "Manages live class sessions with timers, call signaling, feedback submission, and auto-join logic via URL parameters.",
  "frontend/src/pages/LoginPage.tsx": "Displays an Internet Identity login screen and redirects authenticated users to a target route.",
  "frontend/src/pages/SignupProfilePage.tsx": "Allows users to create a profile by entering a name and skills, then submits it to the backend.",
  "frontend/src/pages/SkillMatchPage.tsx": "Provides search and category filtering for mock skill matches and lets logged‑in users book sessions.",
  "frontend/src/utils/creditCalculation.ts": "Contains a deterministic function to compute earned credits from session duration and rating.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using sessionStorage and hash/query parsing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature definitions, architectural notes, and requirements for building the Skill Sync website. Includes UI feature descriptions, project versions, and planned pages like Home, Dashboard, Skill Match, and Live Class."
}