{
  "backend/main.mo": "Actor managing user profiles, timed sessions, permissions, and feedback with session timers and access control.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend files and components.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode styling.",
  "frontend/index.html": "HTML entry point mounting the root React application.",
  "frontend/src/App.tsx": "Main React router setup with authenticated and profile-protected routes wrapped in theme provider.",
  "frontend/src/components/auth/AuthButtons.tsx": "Login/logout UI using Internet Identity with a dropdown for authenticated users.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard redirecting unauthenticated users to login with loading handling.",
  "frontend/src/components/auth/RequireProfile.tsx": "Route guard ensuring users have created a profile before accessing protected pages.",
  "frontend/src/components/feedback/StarRating.tsx": "Interactive or readonly star rating component with hover effects.",
  "frontend/src/components/layout/AppShell.tsx": "Shared layout wrapper adding navbar, footer, and background gradient around page content.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, contact info, social links, and a dynamic year plus caffeine.ai attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Implements a responsive navigation bar with links, theme toggle, auth buttons, and a mobile sheet menu.",
  "frontend/src/components/marketing/FeaturesSection.tsx": "Displays four feature cards highlighting platform capabilities like live classes and smart matching.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Shows a three‑step explanation of how the platform works using icon cards and step indicators.",
  "frontend/src/components/match/MatchCard.tsx": "Card component showing a match’s name, skills, rating, credit cost, and a button to book a session.",
  "frontend/src/components/theme/ThemeToggle.tsx": "A toggle button that switches between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, stored identities, and auth client creation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile operations, session start, and feedback submission using the actor.",
  "frontend/src/hooks/useSessionsLocal.ts": "React hook managing per-identity localStorage sessions with add and remove helpers.",
  "frontend/src/hooks/useSessionTimer.ts": "Implements a simple session timer hook with start, stop, and reset, tracking elapsed seconds.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables and utility classes.",
  "frontend/src/main.tsx": "App entry that mounts React, sets up React Query, and wraps with InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user profile, credits, skills, ratings, quick actions, and upcoming sessions.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, marketing sections, testimonials, and actions to learn or teach.",
  "frontend/src/pages/LiveClassPage.tsx": "Live session interface with timer, mock video area, session start/stop logic, and feedback submission.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with redirect handling and a simple sign‑in UI.",
  "frontend/src/pages/SignupProfilePage.tsx": "Signup form allowing users to enter a name, add skills, and create their profile.",
  "frontend/src/pages/SkillMatchPage.tsx": "React page that displays mock skill match cards with search, category filters, and booking logic storing sessions locally.",
  "frontend/src/utils/creditCalculation.ts": "Provides a deterministic credit calculation function based on duration and rating with basic validation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, typography, and container settings with plugins.",
  "project_state.json": "Project metadata describing Skill Sync’s goals, features, requirements, and current architectural notes."
}