{
  "kind": "build_request",
  "title": "Enable real 1:1 video calls in Live Class (WebRTC with IC-based signaling)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Replace the Live Class page’s video placeholder with a working 1:1 in-browser video call experience that can connect two authenticated users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i  want that this will connect two persons via video calls"
        ]
      },
      "acceptanceCriteria": [
        "On /live-class, the UI shows the local video preview and a remote video area (when connected).",
        "The page provides call controls at minimum: Start/Join call, End call, and clear connection status text (e.g., “Waiting for peer…”, “Connecting…”, “Connected”, “Disconnected”).",
        "The existing session timer and feedback/credits UI remain functional and usable alongside the video UI.",
        "If camera/microphone permission is denied/unavailable, the UI shows a clear error message and does not crash."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement 1:1 call signaling in the Motoko backend actor to allow two peers to exchange WebRTC offers/answers and ICE candidates via the canister (no third-party video SDK).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i  want that this will connect two persons via video calls"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an API to: create a new call (returns a callId), join an existing call by callId, send signaling messages (offer/answer/ICE) to the other participant, poll/fetch pending signaling messages, and end/cleanup a call.",
        "A call is limited to exactly 2 distinct participants; a third user attempting to join is rejected with a clear error.",
        "Only authenticated users (with the existing user permission model) can create/join/send signaling messages.",
        "Signaling messages are delivered only to the intended other participant (no public leakage).",
        "Calls are cleaned up on explicit end and/or via a reasonable TTL to avoid unbounded growth of in-canister state."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add a simple, shareable “join link” flow so two people can reliably meet in the same 1:1 call without needing user search.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i  want that this will connect two persons via video calls"
        ]
      },
      "acceptanceCriteria": [
        "When a user starts a call, the UI displays a shareable link that includes the callId (e.g., /live-class?callId=...).",
        "When a user opens /live-class with a callId present, the page automatically enters “join” mode and attempts to connect to the call.",
        "The user can copy the link via a button and receives a confirmation toast/message that it was copied.",
        "Invalid/expired callId shows a clear error state and offers a way to start a new call."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Integrate frontend data-flow for signaling using the existing actor/React Query patterns, without modifying immutable hook files, and ensure the call connection state is resilient to refreshes/navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i  want that this will connect two persons via video calls"
        ]
      },
      "acceptanceCriteria": [
        "Frontend uses the existing backend actor (via existing app patterns) to create/join calls and exchange signaling messages.",
        "Signaling receive is implemented using polling (React Query refetch interval or equivalent), since real-time sockets are not available.",
        "Refreshing the page in a call with a valid callId keeps the page in join mode and attempts to reconnect (while clearly indicating the current state).",
        "No changes are requested to any paths listed in frontend.immutablePaths."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add migration.mo if state upgrade requires it.",
    "Do not add third-party authentication; continue using Internet Identity.",
    "Do not use WebSockets/Socket.io or external real-time infrastructure; use canister calls and polling for signaling.",
    "Do not modify files under frontend/src/components/ui or any other frontend.immutablePaths (compose existing components instead)."
  ],
  "nonGoals": [
    "Group calls (more than 2 participants).",
    "Call recording, screen sharing, or text chat.",
    "Integration with external video providers/SDKs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}