{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "1:1 WebRTC video calling on Live Class (frontend integration + join link + polling signaling)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Replace the /live-class video placeholder with a working 1:1 in-browser WebRTC call UI for two authenticated users, including local/remote video and basic call controls with robust permission/error handling.",
      "acceptanceCriteria": [
        "On /live-class, the UI shows the local video preview and a remote video area (when connected).",
        "The page provides call controls at minimum: Start/Join call, End call, and clear connection status text (e.g., “Waiting for peer…”, “Connecting…”, “Connected”, “Disconnected”).",
        "The existing session timer and feedback/credits UI remain functional and usable alongside the video UI.",
        "If camera/microphone permission is denied/unavailable, the UI shows a clear error message and does not crash."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LiveClassPage.tsx",
          "operation": "modify",
          "description": "Replace the current video placeholder Card content with a composed 1:1 call panel (local+remote video, controls, status/error text) while keeping the existing timer and feedback/credits sections intact and usable. Use existing toast messaging for user-visible errors and state changes."
        },
        {
          "path": "frontend/src/components/liveclass/VideoCallPanel.tsx",
          "operation": "create",
          "description": "Create a focused UI component for the video call area: local preview + remote video surface, Start/Join and End buttons, connection status text, and permission/device error display. Use the selected \"camera\" component hook (useCamera) to power the local camera preview; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useWebRTCPeer.ts",
          "operation": "create",
          "description": "Implement a reusable hook that owns the RTCPeerConnection lifecycle (create/close, setLocal/RemoteDescription, handle ICE, attach remote MediaStream to a provided <video> ref, and expose a high-level connection state machine for the UI). Ensure cleanup on unmount and on End call, and handle permission/device failures without throwing unhandled errors."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add a shareable join-link flow using callId in the /live-class URL, including auto-join behavior, copy-to-clipboard, and clear invalid/expired call error state with a start-new-call fallback.",
      "acceptanceCriteria": [
        "When a user starts a call, the UI displays a shareable link that includes the callId (e.g., /live-class?callId=...).",
        "When a user opens /live-class with a callId present, the page automatically enters “join” mode and attempts to connect to the call.",
        "The user can copy the link via a button and receives a confirmation toast/message that it was copied.",
        "Invalid/expired callId shows a clear error state and offers a way to start a new call."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LiveClassPage.tsx",
          "operation": "modify",
          "description": "Read callId from the URL on load (and persist it for refresh resilience) to decide Start vs Join mode. After creating a call, render the shareable join link and a Copy Link button with toast confirmation. If join fails due to invalid/expired callId, show a clear inline error state plus a Start New Call action that clears the invalid callId from the persisted state."
        },
        {
          "path": "frontend/src/components/liveclass/JoinLinkBox.tsx",
          "operation": "create",
          "description": "Create a small composed UI block that renders the current callId, the fully-qualified shareable /live-class?callId=... link, and a Copy button (clipboard + toast). Keep it reusable within the Live Class page and avoid modifying immutable UI component files by composing existing UI primitives."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Extend URL param utilities (without breaking existing behavior) to support the Live Class join-link flow: retrieving a persisted callId from URL or sessionStorage and providing a small helper to persist/clear callId used by /live-class."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Integrate signaling data-flow using existing actor + React Query patterns (polling-based), without modifying immutable hook files, and make connection state resilient across refreshes/navigation when callId is present.",
      "acceptanceCriteria": [
        "Frontend uses the existing backend actor (via existing app patterns) to create/join calls and exchange signaling messages.",
        "Signaling receive is implemented using polling (React Query refetch interval or equivalent), since real-time sockets are not available.",
        "Refreshing the page in a call with a valid callId keeps the page in join mode and attempts to reconnect (while clearly indicating the current state).",
        "No changes are requested to any paths listed in frontend.immutablePaths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCallSignaling.ts",
          "operation": "create",
          "description": "Add new React Query hooks for call signaling using the existing actor pattern (via useActor): create/start call, join call by callId, send signaling messages (offer/answer/ICE), poll/fetch pending signaling messages on an interval, and end call. Ensure polling is enabled only when in an active call flow and actor is available, and surface backend authorization/validation errors to the caller for UI display."
        },
        {
          "path": "frontend/src/pages/LiveClassPage.tsx",
          "operation": "modify",
          "description": "Wire the new signaling hooks into the Live Class call panel: use polling to receive signaling messages and drive the WebRTC peer hook (apply remote offer/answer, add remote ICE candidates). Persist callId (via urlParams helper) so refresh keeps join mode and automatically attempts to reconnect while showing clear state text (Waiting/Connecting/Connected/Disconnected)."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface type definitions to include the new callId-based signaling capabilities required by the Live Class WebRTC flow (create/join, send signaling messages, poll pending messages, end/cleanup), so new React Query hooks can call them in a type-safe way."
        }
      ]
    }
  ]
}