{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T22:34:53.447Z",
  "summary": "Diff adds initial scheduled-session scaffolding across backend and frontend (creation dialogs, join-link dialog, time utilities, React Query hooks, Dashboard/SkillMatch/LiveClass integration). However, multiple BuildRequest acceptance criteria appear unimplemented or only partially implemented: backend session fields and endpoints (title/skill/status, fetch-by-id, cancel, proper listing/upcoming filtering, authorization/read rules, join-window enforcement), frontend hooks (cancel/listUpcoming naming/behavior), and robust call association for scheduled sessions (callId convergence and using the real other participant instead of self-calls).",
  "missing_requirements": [
    {
      "id": "REQ-14",
      "requirement": "Backend scheduled session record must include title (optional), skill, start time, duration, and status (scheduled/active/completed/cancelled), with endpoints to create, list upcoming, fetch by id, join, and cancel (host only), plus auth/read restrictions and join-window trap errors.",
      "reason": "The added/modified backend types for ScheduledSession do not include title, skill, or a status variant; they use fields like `isActive`/`joined` instead. The frontend calls backend methods `scheduleSession` and `joinScheduledSession`, but the diff summary does not show backend implementations or additional endpoints for listing upcoming, fetching by id, or canceling. Authorization/read restrictions and join-window enforcement are not evidenced in the shown backend code.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo"
      ]
    },
    {
      "id": "REQ-15",
      "requirement": "Frontend must add React Query hooks for createScheduledSession, listUpcomingSessions, getScheduledSessionById (if needed), joinScheduledSession, cancelScheduledSession; Dashboard must use backend-sourced upcoming sessions (not localStorage), show Host/Guest, and invalidate caches after create/join/cancel.",
      "reason": "Hooks include create/list/join and a mutation-based `useGetScheduledSessionById` that searches within `getUserScheduledSessions`, but there is no `cancelScheduledSession` hook. The listing hook is `useGetUserScheduledSessions` rather than a clear 'upcoming sessions' query, and the evidence for host/guest labeling in each row is not visible in the truncated Dashboard. Cache invalidation after cancel cannot exist without cancel support.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts",
        "frontend/src/pages/DashboardPage.tsx"
      ]
    },
    {
      "id": "REQ-16",
      "requirement": "Create Session flow must schedule a session with title, skill, date/time, duration, and on success show a shareable join URL containing the scheduled session id; created session should appear immediately.",
      "reason": "CreateSessionDialog collects `title` and `skill`, but the mutation only sends `{ scheduledTime, duration }` to `actor.scheduleSession(...)`, so title/skill are not persisted via the shown API usage. The join link dialog is present, but immediate appearance depends on backend storing full session info and list refresh; the diff only shows invalidation of `['scheduledSessions']`.",
      "evidence": [
        "frontend/src/components/sessions/CreateSessionDialog.tsx",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "id": "REQ-17",
      "requirement": "Timed Join experience: Join disabled until allowed join window per backend rules; early join via link shows clear error and does not start/attach a call; joining routes to Live Class with URL parameters to restore context; both parties end up in same 1:1 call.",
      "reason": "Join gating is implemented client-side via `canJoinSession(...)` (5 minutes) and toast errors, but there is no evidence the backend enforces the same join-window rules or returns a clear trap error. LiveClassPage logic for scheduled sessions is truncated and shows suspicious/incorrect callId assignment (`setCallId(BigInt(activeCall.caller.toString() === myPrincipal ? '1' : '2')); //`), which does not demonstrate reliable routing into the correct call room.",
      "evidence": [
        "frontend/src/utils/scheduledSessionTime.ts",
        "frontend/src/pages/DashboardPage.tsx",
        "frontend/src/pages/LiveClassPage.tsx"
      ]
    },
    {
      "id": "REQ-18",
      "requirement": "Connect scheduled sessions to the existing WebRTC signaling/call flow so calls are created between two distinct authenticated users (not self-calls), with a shared callId associated to the scheduled session so both parties converge reliably (including after refresh).",
      "reason": "No evidence in the diff summary shows backend associating a scheduled session to a `callId` (ScheduledSession type has no callId field). LiveClassPage scheduled-session handling is truncated and does not show deriving the other participant principal from the scheduled session join state, nor a reliable mechanism to obtain/restore the correct callId.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo",
        "frontend/src/pages/LiveClassPage.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added ScheduledSession backend data model fields `isActive` and `joined` instead of the requested `status` enum (scheduled/active/completed/cancelled), and omitted requested fields like `title` and `skill` from the evidenced model.",
      "reason": "BuildRequest explicitly requires status and title/skill on each scheduled session record; the diff implements a different shape, which is an unrequested deviation from the specified contract.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo"
      ]
    },
    {
      "description": "Client-side join-window rule hardcoded to '5 minutes before' in UI utilities and messaging.",
      "reason": "BuildRequest allows an example join window but requires alignment with backend join-window rules; the diff introduces a fixed client-side rule and messaging that may not match backend enforcement (not evidenced).",
      "evidence": [
        "frontend/src/utils/scheduledSessionTime.ts",
        "frontend/src/components/sessions/SessionJoinLinkDialog.tsx"
      ]
    }
  ],
  "confidence": 0.64,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/liveclass/JoinLinkBox.tsx",
    "frontend/src/components/liveclass/VideoCallPanel.tsx",
    "frontend/src/components/sessions/BookSessionDialog.tsx",
    "frontend/src/components/sessions/CreateSessionDialog.tsx",
    "frontend/src/components/sessions/SessionJoinLinkDialog.tsx",
    "frontend/src/hooks/useCallSignaling.ts",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/DashboardPage.tsx",
    "frontend/src/pages/LiveClassPage.tsx",
    "frontend/src/pages/SkillMatchPage.tsx",
    "frontend/src/utils/scheduledSessionTime.ts",
    "project_state.json"
  ]
}