{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T22:13:23.508Z",
  "summary": "Diff adds new frontend components/hooks for a WebRTC-based video panel, join-link UI, and React Query polling for call state; backend main.mo adds Call-related types/state scaffolding and imports a no-op migration. Several BuildRequest acceptance criteria are not evidenced in the diff summary, especially around backend signaling API shape (create/join by callId, message exchange/polling), 2-party enforcement/TTL cleanup, and frontend join-by-link/error flows.",
  "missing_requirements": [
    {
      "id": "REQ-11",
      "requirement": "Backend exposes an API to create a new call (returns callId), join an existing call by callId, send signaling messages (offer/answer/ICE) to the other participant, poll/fetch pending signaling messages, and end/cleanup a call.",
      "reason": "Diff summary only shows backend Call types and state variables (calls map, userActiveCalls, nextCallId) but does not show any of the required public backend methods (create/join/send/poll/end) or a pending-message model; frontend hooks call methods like initiateCall/getActiveCall/answerCall/addIceCandidate/endCall which are not evidenced in backend diff excerpt.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useCallSignaling.ts"
      ]
    },
    {
      "id": "REQ-11",
      "requirement": "A call is limited to exactly 2 distinct participants; a third user attempting to join is rejected with a clear error.",
      "reason": "No evidence in the backend diff excerpt of join logic or participant-count enforcement/rejection behavior.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-11",
      "requirement": "Signaling messages are delivered only to the intended other participant (no public leakage).",
      "reason": "No evidence of per-recipient message routing or access checks for signaling retrieval; frontend appears to poll getActiveCall (entire Call object) which could expose offer/answer/ICE if not strictly restricted, but backend enforcement is not shown in the diff excerpt.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useCallSignaling.ts"
      ]
    },
    {
      "id": "REQ-11",
      "requirement": "Calls are cleaned up on explicit end and/or via a reasonable TTL to avoid unbounded growth of in-canister state.",
      "reason": "No evidence of TTL timers/cleanup logic in the backend diff excerpt; only maps/vars are shown.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-12",
      "requirement": "When a user opens /live-class with a callId present, the page automatically enters join mode and attempts to connect to the call.",
      "reason": "LiveClassPage checks for callId via getPersistedUrlParameter, but the auto-join effect only sets local state if `activeCall` already exists and shows the user is already a participant; there is no evidenced backend call to \"join existing call by callId\" or to fetch call state by callId.",
      "evidence": [
        "frontend/src/pages/LiveClassPage.tsx"
      ]
    },
    {
      "id": "REQ-12",
      "requirement": "Invalid/expired callId shows a clear error state and offers a way to start a new call.",
      "reason": "No evidence of UI state handling for invalid/expired callId (error banner/state + CTA). The shown auto-join logic silently depends on activeCall/participant check without showing an invalid/expired error flow.",
      "evidence": [
        "frontend/src/pages/LiveClassPage.tsx"
      ]
    },
    {
      "id": "REQ-13",
      "requirement": "Ensure the call connection state is resilient to refreshes/navigation; refreshing the page in a call with a valid callId keeps the page in join mode and attempts to reconnect (while clearly indicating the current state).",
      "reason": "Join-link is generated with a hash URL and callId param, and callId is read on mount, but reconnection is gated on `activeCall` and participant check; no evidence of re-joining by callId or re-establishing signaling state after refresh beyond polling getActiveCall.",
      "evidence": [
        "frontend/src/components/liveclass/JoinLinkBox.tsx",
        "frontend/src/pages/LiveClassPage.tsx",
        "frontend/src/hooks/useCallSignaling.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Call initiation is implemented as specifying a callee Principal (and in LiveClassPage it initiates a call to the caller themself 'for demo purposes'), rather than a shareable callId-based create/join flow.",
      "reason": "BuildRequest requires a join-link flow to meet without user search (create returns callId; peer joins by callId). The diff instead introduces `initiateCall(callee, offer)` and explicitly calls self as callee in LiveClassPage, which is not requested and conflicts with the intended join-by-link mechanism.",
      "evidence": [
        "frontend/src/hooks/useCallSignaling.ts",
        "frontend/src/pages/LiveClassPage.tsx"
      ]
    },
    {
      "description": "Use of public Google STUN servers (stun.l.google.com) configured in the WebRTC hook.",
      "reason": "Not mentioned in the BuildRequest; while STUN is common for WebRTC, it is an external network dependency that was not explicitly requested in the requirements.",
      "evidence": [
        "frontend/src/hooks/useWebRTCPeer.ts"
      ]
    },
    {
      "description": "Added backend/migration.mo and wired migration into backend/main.mo as a no-op migration.",
      "reason": "BuildRequest allows adding migration.mo only if state upgrade requires it; diff shows a no-op migration with no demonstrated need/upgrade logic in the truncated summary.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/liveclass/JoinLinkBox.tsx",
    "frontend/src/components/liveclass/VideoCallPanel.tsx",
    "frontend/src/hooks/useCallSignaling.ts",
    "frontend/src/hooks/useWebRTCPeer.ts",
    "frontend/src/pages/LiveClassPage.tsx",
    "project_state.json"
  ]
}